In [65]:
import pandas as pd
data = [
    {"name": "Juliet", "age": 12, "gender": "woman"},
    {"name": "Roberth", "age": 22, "gender": "man"},
    {"name": "Manuel", "age": 32, "gender": "man"},
]

# to dataframe
dataset = pd.DataFrame(data)
# order columns
dataset[["name", "gender", "age"]]
# show first rows
head = dataset.head()
head
# show unique column in dataset
dataset[["gender"]]
# show unique column in series
dataset["gender"]
# show by range
dataset[1:3]
# search element by tag
dataset.loc[dataset["name"] == "Manuel"]
dataset.loc[dataset["age"] == 32]
dataset.loc[:, ["age"]]
# search by index
dataset.iloc[[2]]
# search by index and range and order
dataset.iloc[1:2, [0, 2, 1]]
# filter
dataset.iloc[[1,2], [0, 2, 1]]
# no filter but order
dataset.iloc[:, [0, 2, 1]]
# get names
dataset.name
# get true with name is Roberth then filter
dataset.name == "Roberth"
dataset[dataset.name == "Roberth"]
# more filter age is 22
dataset[(dataset.name == "Roberth") & (dataset.age == 22)]
# same filter
dataset.query('name == "Roberth" and age == 22')
# iterate dataframe
for item in dataset:
    print(item)
# get tuple by dataset
list(dataset.iterrows())
# unpack tuple and sum all ages and get amount
for index, row in dataset.iterrows():
    if(30 - row.age != 0):
        dataset.loc[index, 'age_total'] = row.age / (30 - row.age)
    else:
        dataset.loc[index, 'age_total'] = 0
dataset

name
age
gender

      name  age gender  age_total
0   Juliet   12  woman   0.666667
1  Roberth   22    man   2.750000
2   Manuel   32    man -16.000000

In [ ]:
# from file csv
import pandas as pd
dataset = pd.read_csv("db.csv", sep=";", index_col=0)
# check head

In [79]:
# clean data
import pandas as pd
data = [
    {"name": "Juliet", "age": 12, "gender": "woman"},
    {"name": "Roberth", "age": 22, "gender": "man"},
    {"name": "Manuel", "age": 32, "gender": "man"},
    {"name": "Javier", "age": 22, "gender": "man"},
    {"name": "Luisa", "age": 32},
]

dataset = pd.DataFrame(data)
# check info for consult null values
dataset.info()
# check row with null
dataset[dataset.gender.isna()]
# fill null value with empty
# inplace replace values in dataframe
dataset.fillna("empty", inplace=True) 
dataset
# query for check changes
dataset.query('gender == "empty"')

# another option to clean null
dataset2 = pd.DataFrame(data)
# drop value with null
dataset2.dropna(subset = ["gender"], inplace=True)
dataset2

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   gender  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

      name  age gender
0   Juliet   12  woman
1  Roberth   22    man
2   Manuel   32    man
3   Javier   22    man